app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]
---
	def find_mwsd
    id = params[:id]
		director = Movie.find(id).director

UPDATE "movies" SET "title" = 'The Abyss', "director" = 'Tommy', "release_date" = '1968-06-06 00:00:00.000000', "updated_at" = '2013-08-15 06:01:26.977995' WHERE "movies"."id" = 7
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])