app/controllers/movies_controller.rb

  def with_same_director
    @movies = Movie.find_mwsd(params[:id].to_i)
    if @movies.nil?
      unless Movie.all.empty?
        title = Movie.find(params[:id]).title
---
SELECT "movies".* FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."title" = 'Alien' LIMIT 1